#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-9cf8e7/terraform-workshop/runs/run-msfdhsBxGvrzJZ5H

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=0e25d02a1ec922d534c552bb022451799112f6af]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5106310112685082194]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/my-lambda1]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=my-lambda1]
aws_iam_user.lb: Refreshing state... [id=loadbalancer]
module.test_modules.aws_iam_user.lb: Refreshing state... [id=test-lb]
aws_iam_access_key.lb: Refreshing state... [id=AKIARPWUTQE5PMISXXH5]
aws_iam_user_policy.lb_ro: Refreshing state... [id=loadbalancer:test]
module.test_modules.aws_iam_access_key.lb: Refreshing state... [id=AKIARPWUTQE5IVVQT45M]
module.test_modules.aws_iam_user_policy.lb_ro: Refreshing state... [id=test-lb:test-policy]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=my-lambda1]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::102451347770:policy/my-lambda1-logs]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=my-lambda1-20220407100707815000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_user_policy.lb_ro must be replaced
-/+ resource "aws_iam_user_policy" "lb_ro" {
      ~ id     = "loadbalancer:test" -> (known after apply)
      ~ name   = "test" -> "dontettetetets" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5106310112685082194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1649326456878928000" -> "1649326787267438800"
            # (1 unchanged element hidden)
        }
    }

  # module.test_modules.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "My test policy"
      + id          = (known after apply)
      + name        = "test_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pusher: @andylim0221, Action: `pull_request`*